Tekla.Structures.Model.UI.ClipBox
The ClipBox class groups multiple clip planes under a single identifier.

Tekla.Structures.Model.UI.ClipBox.ClipPlanes
Gets or sets the clip planes contained by this clip box.

Tekla.Structures.Model.UI.ClipBox.View
Gets the view the clip box belongs to.

Tekla.Structures.Model.UI.ClipBox.#ctor(Tekla.Structures.Model.UI.View,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.UI.ClipPlane})
Initializes a new instance of the Tekla.Structures.Model.UI.ClipBox class with 6 clip planes.
view: The view where the clip box is inserted to
clipPlanes: Optional initial clip planes.

Tekla.Structures.Model.UI.ClipBox.Insert
Creates a new clip box to the application view.
The application view must be visible.
Returns: True on success.

Tekla.Structures.Model.UI.ClipBox.Delete
Deletes the clip box from the application view.
The application view must be visible.
Returns: True on success.

Tekla.Structures.Model.UI.ClipBox.Modify
Modifies the clip box position in the application view.
The application view must be visible.
Returns: True on success.